package com.example.hasee.bean;

import java.io.Serializable;
import java.util.List;

/**
 * Demo ${CLASS}
 *
 * @author TT
 * @date 2018/6/19 16:34
 */

public class HistoryTodayBean implements Serializable {
    /**
     * msg : success
     * result : [{"date":"12830109","day":9,"event":"　　文天祥（1236\u20141283）字履善，一字宋瑞，号文山。吉州庐陵（今江西吉安）人。1256年（理宗宝佑四年）中进士第一名。在贾似道当权时受排挤。1275年，元军进边临安，宋朝廷下诏征勤王兵。任赣州知州的文天祥组成万人的义军，北上人卫。1276年任右丞相，被派往无军营谈判，被扣留。押解中在镇江逃出，得到人民的帮助，流亡至通州（今江苏南通），从海道到福建，与张世杰、陆秀夫等在福州拥生赵呈为帝，坚持抗元。1277年进兵江西收复了几个县城，使抗无形势大力好转。但不久为元军所败，退人广东。1278年在五坡岭（今广东海丰北）被俘。元将张弘范叫他写信招张世杰投降，遭拒绝，书《过零丁洋》诗以明志：辛苦遭逢起一经，干戈寥落四周星。山河破碎风飘絮，身世浮沉雨打萍。惶恐滩头说惶恐，零丁洋里叹零叮人生自古谁无死，留取丹心照汗青。1279年被送到大都（今北京），囚3年，途经威胁利诱，始终不屈。1283年1月9日（至元十九年十二月初九日）在柴市被害，从容就义。\n","id":"569881af590146d4073317d0","month":1,"title":"文天祥殉难"},{"date":"19150109","day":9,"event":"　　1915年1月9日，温斯顿·丘吉尔提出的在达达尼尔海峡登陆，减轻俄土战线的压力，进而威胁君士坦丁堡的设想，在战略上固然相当高明，但实行起来却搞得一团糟。英法舰队在2月炮轰达达尼尔海峡。3月，18艘军舰企图强行闯入狭窄的海峡通道， 4艘军舰立即触发水雷，舰只慌忙撤退。至此，德国军事顾问已洞悉对方计划中的加里波利登陆战，火速调动10万军队至战区，掘壕坚守，又在该地集结炮兵部队。\n","id":"569881af590146d4073317cf","month":1,"title":"第一次世界大战英军发起加里波利战役"},{"date":"19280109","day":9,"event":"　　1928年1月9日，蒋介石下野3个月后再次上台，去年8月，蒋介石下野，同年11月10日，蒋由日本返抵上海。为反对桂系据有国民党中央特别委员会实权，决定联汪制桂。\n　　蒋、汪达成协议：蒋复任总司令，汪复任国民政府主席。11月17日，粤、桂战争爆发。12月11日，中国共产党发动广州起义。两次事件都被反汪各派作为攻击汪精卫的借口。\n　　汪受各方指责，秘密离沪出国，蒋介石成了国民党的中心人物，各派纷纷电促他复职。今年1月4日，蒋回南京\u201c主持大计\u201d，9日通电宣告复职。\n","id":"569881af590146d4073317ce","month":1,"title":"蒋介石东山再起，复任总司令"},{"date":"19460109","day":9,"event":"　　1946年1月9日，盟国最高司令部又指示东京盟军最高统帅部，在东京设置远东国际军事法庭，审判与惩处日本法西斯首要战犯。\n　　参加远东国际军事法庭的中国法官是梅汝敖、检察官向哲浚，担任助理的法律专家、历史学家是裘劭恒、方福枢、杨寿林、刘子健等。梅汝敖是国民政府立法院委员兼外交委员会主席，向哲浚是上海特区法院首席检察官。\n　　法庭审讯工作错综复杂。审讯中除规定采劝英美法\u201d诉讼程序外，还规定每一个被审讯的战犯除设有自聘的日本律师及辩护人外，都要配置一名美国律师。这些美国律师为一些没有危害美国利益的战犯\u201c寻机开脱\u201d。\n　　事前国民政府没有进行充分准备，以为只要法官、检察官的\u201c金口一开、大笔一落\u201d，就能严惩战犯，所以没有准备足够的人证、物证材料，因此，审判一开始，中方代表就陷入有冤难伸、有苦难言的被动局面。这使代表们痛心疾首，又气又急。\n　　为了迅速摆脱困境，中国代表立即分头去盟军总部查阅日本内阁和陆军省等几个部门的档案。日本十几年的档案资料，包括文件、作战命令、来往电报等等，难以数计。代表们先是摘抄、翻译、整理出原始材料，然后根据这些材料拟出发言材料，为此他们夜以继日。有些罪行，日本档案资料没有记载，只能通过实地调查取得实证。\n　　如为了搜集南京大屠杀的罪行材料，中国代表专程回国调查，找到了南京大屠杀的幸存者，并将此人带到东京出庭作证。经过代表们一段时间的紧张工作，中方掌握了大量有力的罪证，这是那些侵华战犯所始料不及的。\n　　审讯板垣时，为他出庭的辩护律师和证人有15人。在涉及到板垣参与\u201c九·一八\u201d事件时，进攻中国的日军联队长岛本作证说：\u201c他那天晚上在朋友家喝酒，喝得醉熏熏的，回家后就得到了\u201c九·一八\u201d事变发生的报告。\n　　中国检察官当即打断他的话反问：\u201c岛本既然声称自己当晚喝醉了，那么，一个糊涂的酒鬼能证明什么？又怎能出庭作证人呢？\u201d结果，岛本被轰下庭去。这个下马威使板垣的辩护班子乱了手脚。\n　　中国检察官不仅要先花力气击败日本的律师和证人，还要对付美国律师的辩护。\n　　土肥原贤二在侵略中国中犯下滔天罪行，出庭时，他的辩护律师竟说土肥原为人厚道。为此，中国检察官严辞反驳，并出示当年奉天特务机关专门用来向日本政府邀功请赏的报纸。其中一页上载有\u201c华南人士一闻土肥原、板垣之名，有谈虎色变之慨\u201d的话。\n　　中国检察官说，这是土肥原和板垣两个残害中国人民凶狠如虎的写照。但美国律师竟为之辩护说这是在谈老虎，与本案被告无关。\n　　中国检察官冷静地解释地道：\u201c\u2018谈虎色变\u2019，是说土肥原、板垣两人凶狠如虎，人们听到他们的名字，就像提到老虎一般，害怕脸色都变了。\u201d美国律师无言以答，全场哄堂大笑。\n　　中国法官从开庭到最后宣判，用了8天时间，宣读了长达1200多页的判决书。东条、松井、土肥原、板垣、广田等战争罪犯终被送上绞刑架。\n","id":"569881af590146d4073317cd","month":1,"title":"中国代表在远东国际军事法庭参加审判日本战犯"},{"date":"19640109","day":9,"event":"　　1964年1月9日是巴拿马共和国的国定\u201c全国哀悼日\u201d。巴拿马运河是沟通大西洋和太平洋的重要航运水道。1881年动工开凿。1903年，美国政府通过它强加给巴拿马的美巴条约，攫取了开凿运河的权利和对运河区的永久租让权。在施工中，约有六七万名劳工丧生。巴拿马运河1914年凿通后，美国把运河区变成国中之国，由美国政府任命总督，升美国国旗，实行美国法律、驻美国军队、每年从运河税中掠夺走1亿多美元。巴拿马人民不断为收回运河主权进行斗争。1964年1月，巴拿马掀起了震撼世界的反美斗争风暴。1月9日，一批学生要求在巴拿马运河区升起巴拿马国旗，遭到美军镇压。当天3万巴拿马人集合起来要求进入运河区并在那里升起巴拿马国旗，美军屠杀示威群众。愤怒的人们袭击了美国大使馆，焚烧美国新闻处，许多城市群众罢工、罢课、罢市，抗议美国暴行，要求收回运河主权。1965年，巴拿马政府规定1月9日为\u201c全国哀悼日\u201d。号召人民继续斗争，直至1977年9月7日，美国被迫和巴拿马政府签署了新的美巴条约，取消美永久性占有的特权。巴拿马人民的斗争终于取得胜利。\n","id":"569881af590146d4073317cc","month":1,"title":"巴拿马的\u201c全国哀悼日\u201d"},{"date":"19680109","day":9,"event":"　　1968年1月9日由沙特阿拉伯、科威特、利比亚三国创建的阿拉伯石油输出国组织成立。总部设在科威特。\n","id":"569881af590146d40733177e","month":1,"title":"阿拉伯石油输出国组织成立"},{"date":"19720109","day":9,"event":"　　梁思成，1901年生。广东新会人。中国建筑学家，中国科学院学部委员，清华大学教授，中国近代思想家、历史学家梁启超之子。\n　　1915年入清华学校学习，1924年赴美留学，1927年获法尼亚大学建筑系硕士学位，旋入哈佛大学美术研究院学习。1928年回国，任东北大学建筑系教授、系主任。1931年任中国营造学社研究员。1941年任前中央研究院研究员。1946年以后一直担任清华大学建筑系教授兼主任。1947年担任联合国大厦设计委员会顾问。1948年获美国普林斯顿大学名誉博士学位。\n　　他为中华人民共和国国徽、首都人民英雄纪念碑和扬州鉴真和尚纪念堂等建筑设计作出了贡献。\n　　著作有《清代营造则例》、《宋营造法式》、《中国建筑史》等，受到中外学者的重视。\n　　1972年1月9日逝世。\n","id":"569881af590146d4073317cb","month":1,"title":"中国建筑学家梁思成逝世"},{"date":"19800109","day":9,"event":"　　1980年1月9日。沙特与美国双方官员早就声称去年11月份进攻麦加大清真寺的事件是伊朗什叶派伊斯兰教徒干的。今天当曾经参加这场轰动世界的进攻事件的63人被砍头时，沙美双方的早期声明又发生了矛盾。被处决的63人中无一人是伊朗人，他们的领导人是一位自诩为预言家的沙特人，叫朱赛·莫宾·赛夫。\n　　在实际上是一次沙特叛乱中，他是军事指挥官。这63人中，有41名是沙特人，10名是埃及人，6名是南也门人，3名是科威特人， 1名也门人，1名苏丹人和1名伊拉克人。这次进攻不是由少数人发起的，根据沙特阿拉伯所统计的数字，有700多人参加了这次反叛。在导致政府收复清真寺的战在导致政府收复清真寺的战斗中117名叛者被杀，143名被俘；政府有127人丧生，451人受伤。官方声明说，一些向反叛者提供武器和一些在进攻中帮助过他们的俘虏，在两年内将经受\u201c宗教再教育\u201d。\n","id":"569881af590146d4073317ca","month":1,"title":"沙特判处进攻麦加清真寺的63名叛乱者死刑"},{"date":"19830109","day":9,"event":"　　1983年1月9日，位于中美洲的哥伦比亚、委内瑞拉、墨西哥和巴拿马四国的外长在巴拿马的孔塔多拉岛举行会议，专门就解决中美洲争端问题进行了讨论与协商，并通过了《和平解决中美洲问题倡议》，呼吁中美洲五国在没有外来干涉的情况下直接谈判，要求一切外国军事顾问从这一地区撤出，停止向这里输送武器。从此，国际上把这四个国家称为\u201c孔塔多拉集团\u201d。孔塔多拉岛位于太平洋巴拿马湾内距巴拿巴城东南约80公里处，是珍珠群岛中离陆地最近的一个岛，面积只有3平方公里。孔塔多拉一词，在西班牙语中有计算、清点的意思。关于它的命名还有一段趣闻。1513年，西班牙殖民者巴尔博亚从大西洋登陆，越过巴拿巴地峡，到达印地安人称为南海的太平洋。不久，殖民者的铁蹄踏遍了太平洋巴拿马湾的一百多个大小岛屿，在岛上发现了不计其数的珍珠，因此把这些岛屿命名为珍珠群岛。他们把各个岛上的珍珠收集到离陆地最近的岛上清点数目，装船运往欧洲。日久天长，清点数目\u2014\u2014\u201c孔塔多拉\u201d就成了这个小岛的名字。孔塔多拉集团成立后，要求中美洲各国放弃武力对抗，不要采取任何可能恶化局势的行动，努力以和平谈判手段解决中美洲各国间的争端问题。孔塔多拉集团国家反对超级大国或任何其他国家插足中美洲国家的内部事务，或在中美洲划分势力范围。它不止一次地向美、苏、古巴等有关国家领导人发出呼吁，要求他们停止干涉中美洲国家事务，让中美洲国家人民在没有外来干涉的情况下自己解决本地区问题。为和平解决中美洲冲突，孔塔多拉集团国家不仅自己召开过多次会议，而且还与萨尔瓦多、哥斯达黎加、洪都拉斯、危地马拉、尼加拉瓜等有关国家共同召开过九国外长会议，谋求和平解决中美洲问题的方案。1983年7月17日，孔塔多拉集团国家还在墨西哥的坎昆城召开会议，并发表了《关于中美洲和平的坎昆宣言》。重申国家自主权平等、在经济与社会领域内进行合作以及和平解决争端等各项原则，提出停止外来干涉、撤走外国军事顾问、停止武器出售等项建议。这是孔塔多拉集团为解决中美洲问题所采取的又一重要步骤。1984年9月，孔塔多拉集团国家又拟定了《中美洲和平条约(草案)》，并为签署和实现这一条约草案进行了大量外交活动。集团为维护中美洲的稳定与和平所进行的活动得到了国际社会的普遍支持。联合国安理会曾作出决议，要求孔塔多拉集团随时向安理会通报它的工作情况，并呼吁有关国家与这个集团充分合作。\n","id":"569881af590146d4073317c9","month":1,"title":"孔塔多拉集团形成"},{"date":"19890109","day":9,"event":"　　1989年1月9日，洛克比空难过后还不到一个月，英国在1989年1月9日又经历了一场惨重的航空悲剧，一架从伦敦飞往贝尔法斯特的波音737客机坠毁在莱斯特郡。\n　　这架航行仅12周的客机从东米德兰机场的跑道上起飞才15秒钟，引擎就发生了故障，在作紧急着陆时，意外地撞毁在高速公路的路基上。最初的报道显示，事故可能是飞机驾驶员误关了不该关的引擎所致。\n","id":"569881af590146d4073317c8","month":1,"title":"英国米德兰航空公司的波音737飞机失事"}]
     * retCode : 200
     */

    private String msg;
    private String retCode;
    private List<ResultBean> result;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean implements Serializable{
        /**
         * date : 12830109
         * day : 9
         * event : 　　文天祥（1236—1283）字履善，一字宋瑞，号文山。吉州庐陵（今江西吉安）人。1256年（理宗宝佑四年）中进士第一名。在贾似道当权时受排挤。1275年，元军进边临安，宋朝廷下诏征勤王兵。任赣州知州的文天祥组成万人的义军，北上人卫。1276年任右丞相，被派往无军营谈判，被扣留。押解中在镇江逃出，得到人民的帮助，流亡至通州（今江苏南通），从海道到福建，与张世杰、陆秀夫等在福州拥生赵呈为帝，坚持抗元。1277年进兵江西收复了几个县城，使抗无形势大力好转。但不久为元军所败，退人广东。1278年在五坡岭（今广东海丰北）被俘。元将张弘范叫他写信招张世杰投降，遭拒绝，书《过零丁洋》诗以明志：辛苦遭逢起一经，干戈寥落四周星。山河破碎风飘絮，身世浮沉雨打萍。惶恐滩头说惶恐，零丁洋里叹零叮人生自古谁无死，留取丹心照汗青。1279年被送到大都（今北京），囚3年，途经威胁利诱，始终不屈。1283年1月9日（至元十九年十二月初九日）在柴市被害，从容就义。

         * id : 569881af590146d4073317d0
         * month : 1
         * title : 文天祥殉难
         */

        private String date;
        private int day;
        private String event;
        private String id;
        private int month;
        private String title;

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }

        public int getDay() {
            return day;
        }

        public void setDay(int day) {
            this.day = day;
        }

        public String getEvent() {
            return event;
        }

        public void setEvent(String event) {
            this.event = event;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public int getMonth() {
            return month;
        }

        public void setMonth(int month) {
            this.month = month;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }
}
